const testCase = [
    'U002 2017-08-01 19:00~22:00 A',
    'U003 2017-08-01 18:00~20:00 A',
    'U002 2017-08-01 19:00~22:00 A C',
    'U002 2017-08-01 19:00~22:00 A C',
    'U003 2017-08-01 18:00~20:00 A',
    'U003 2017-08-02 13:00~17:00 B',
];


// {用户 ID} {预订日期 yyyy-MM-dd} {预订时间段 HH:mm~HH:mm} {场地}
// {用户 ID} {预订日期 yyyy-MM-dd} {预订时间段 HH:mm~HH:mm} {场地} {取消标记}
const regInput = /^(\w+)\s(\d{4}-\d{2}-\d{2})\s(\d{1,2}:\d{2})~(\d{1,2}:\d{2})\s(\w+)(?:\s(\w))$/;

console.log(testCase[0].match(regInput));

